Revit 2017 API
FormatUtils Class
 A utility class for formatting numbers with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This class is deprecated in Revit 2015.  Use the formatting utilities in the UnitFormatUtils class instead.")]
public static class FormatUtils
Visual Basic
<ObsoleteAttribute("This class is deprecated in Revit 2015.  Use the formatting utilities in the UnitFormatUtils class instead.")> _
Public NotInheritable Class FormatUtils
Visual C++
[ObsoleteAttribute(L"This class is deprecated in Revit 2015.  Use the formatting utilities in the UnitFormatUtils class instead.")]
public ref class FormatUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormatUtils
See Also
FormatUtils Members
Autodesk.Revit.DB Namespace